namespace consoleProject
{
    /*
     * ФИО студента: Хамитов Айнур Ильгизович
     * номер варианта: 8
     * условие задачи (скопировать из листа задания): 
     * 1 Реализуйте генератор отчетов, где отчеты могут быть различных форматов (PDF, Word, Excel), и используйте шаблонный метод для обработки общих шагов.
     * 2 Разработайте приложение для оплаты, где можно находиться в состояниях (выбор услуги, ожидание оплаты, подтверждение оплаты). Доступные действия зависят от состояния.
     * 3 Напишите приложение для управления проектами, позволяющее выполнять команды для создания, обновления и удаления задач проекта, с историей изменений.
     */
    internal class Program
    {
        static void Main(string[] args)
        {
            
        }
    }
}